In [302]:
from datetime import datetime
import pandas as pd

In [303]:
now=datetime.now()
now

datetime.datetime(2023, 7, 20, 11, 50, 58, 656601)

In [304]:
type(now)

datetime.datetime

In [305]:
df=pd.DataFrame()

In [306]:
df["date"]=["2017-2-23","2019-2-26"]

In [307]:
df

        date
0  2017-2-23
1  2019-2-26

In [308]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    2 non-null      object
dtypes: object(1)
memory usage: 144.0+ bytes

In [309]:
df.iloc[0,0]="N/A"
df

        date
0        N/A
1  2019-2-26

In [310]:
df["date"]=pd.to_datetime(df["date"],infer_datetime_format=True,errors="coerce")

In [311]:
df

        date
0        NaT
1 2019-02-26

In [312]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 144.0 bytes

In [313]:
now

datetime.datetime(2023, 7, 20, 11, 50, 58, 656601)

In [314]:
now.strftime("%d-%B-%Y")

'20-July-2023'

In [315]:
df

        date
0        NaT
1 2019-02-26

In [316]:
df.iloc[1].dt.year

date    2019
Name: 1, dtype: int64

In [317]:
df["date"].drop(0,inplace=True)

In [318]:
df["year"]=df["date"].dt.year
df

        date    year
0        NaT     NaN
1 2019-02-26  2019.0

In [319]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1 non-null      datetime64[ns]
 1   year    1 non-null      float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 160.0 bytes

In [320]:
df.dropna(inplace=True)

In [321]:
df

        date    year
1 2019-02-26  2019.0

In [322]:
df=pd.read_csv("transactions.csv")
df.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 6.6 MB

In [323]:
df["date"]=pd.to_datetime(df["date"],errors="coerce",infer_datetime_format=True)
df.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 1.9 MB

In [324]:
df["date"].max()

Timestamp('2017-08-15 00:00:00')

In [325]:
df["time_to_maxdate"]=df["date"].max()-df["date"]

In [326]:
df.head()

        date  store_nbr  transactions time_to_maxdate
0 2013-01-01         25           770       1687 days
1 2013-01-02          1          2111       1686 days
2 2013-01-02          2          2358       1686 days
3 2013-01-02          3          3487       1686 days
4 2013-01-02          4          1922       1686 days

In [327]:
df["year"]=df["date"].dt.year
df["month"]=df["date"].dt.month
df["day_of_week"]=df["date"].dt.day_of_week

In [328]:
df.head()

,date,store_nbr,transactions,time_to_maxdate,year,month,day_of_week
0,2013-01-01,25,770,1687 days,2013,1,1
1,2013-01-02,1,2111,1686 days,2013,1,2
2,2013-01-02,2,2358,1686 days,2013,1,2
3,2013-01-02,3,3487,1686 days,2013,1,2
4,2013-01-02,4,1922,1686 days,2013,1,2

In [329]:
df["time_to_maxdate"]=df["time_to_maxdate"].dt.days
df.head()

,date,store_nbr,transactions,time_to_maxdate,year,month,day_of_week
0,2013-01-01,25,770,1687,2013,1,1
1,2013-01-02,1,2111,1686,2013,1,2
2,2013-01-02,2,2358,1686,2013,1,2
3,2013-01-02,3,3487,1686,2013,1,2
4,2013-01-02,4,1922,1686,2013,1,2

In [330]:
pd.to_timedelta(5,"d")

Timedelta('5 days 00:00:00')

In [331]:
df["date"]-pd.to_timedelta(5,"d")

0       2012-12-27
1       2012-12-28
2       2012-12-28
3       2012-12-28
4       2012-12-28
           ...
83483   2017-08-10
83484   2017-08-10
83485   2017-08-10
83486   2017-08-10
83487   2017-08-10
Name: date, Length: 83488, dtype: datetime64[ns]

In [332]:
df

,date,store_nbr,transactions,time_to_maxdate,year,month,day_of_week
0,2013-01-01,25,770,1687,2013,1,1
1,2013-01-02,1,2111,1686,2013,1,2
2,2013-01-02,2,2358,1686,2013,1,2
3,2013-01-02,3,3487,1686,2013,1,2
4,2013-01-02,4,1922,1686,2013,1,2
...,...,...,...,...,...,...,...
83483,2017-08-15,50,2804,0,2017,8,1
83484,2017-08-15,51,1573,0,2017,8,1
83485,2017-08-15,52,2255,0,2017,8,1
83486,2017-08-15,53,932,0,2017,8,1
83487,2017-08-15,54,802,0,2017,8,1

In [335]:
df["year"]=df["date"].dt.year
df["month"]=df["date"].dt.month
df.head()

,date,store_nbr,transactions,time_to_maxdate,year,month,day_of_week
0,2013-01-01,25,770,1687,2013,1,1
1,2013-01-02,1,2111,1686,2013,1,2
2,2013-01-02,2,2358,1686,2013,1,2
3,2013-01-02,3,3487,1686,2013,1,2
4,2013-01-02,4,1922,1686,2013,1,2

In [338]:
df.pivot_table(index="year",columns="month",values="transactions",aggfunc="sum")

month,1,2,3,4,5,6,7,8,9,10,11,12
year,,,,,,,,,,,,
2013,2289558.0,2169615.0,2458683.0,2344905.0,2467465.0,2392206.0,2401968.0,2461139.0,2380462.0,2408440.0,2369866.0,2962866.0
2014,2393528.0,2278167.0,2545427.0,2455666.0,2503262.0,2399144.0,2442341.0,2537572.0,2449131.0,2503310.0,2450298.0,3049083.0
2015,2489059.0,2345984.0,2625500.0,2533355.0,2673911.0,2530903.0,2604784.0,2675057.0,2545252.0,2610484.0,2528193.0,3149888.0
2016,2371205.0,2465798.0,2607658.0,2631797.0,2666157.0,2491063.0,2594087.0,2536111.0,2436974.0,2526000.0,2529516.0,3195971.0
2017,2612848.0,2448370.0,2680645.0,2667808.0,2801884.0,2668863.0,2784026.0,1335692.0,NaN,NaN,NaN,NaN